Import numpy and pandas

In [33]:
import numpy as np
import pandas as pd

Create a python dictionary with 5 labels and 5 numbers of your choice.
Call it my_data.

In [34]:
my_data =  {"apple": 241, "google": 207, "microsoft": 162, "amazon": 135, "facebook": 70}

Create a pandas Series from the my_data dictionary, called my_series.
Display it.

In [35]:
my_series = pd.Series(my_data)
my_series

apple        241
google       207
microsoft    162
amazon       135
facebook      70
dtype: int64

Create a 5x5 array of random integers, from 0 to 100 called nums.
Display it.

In [36]:
nums = np.random.randint(low=0, high=100, size=[5,5])
nums

array([[41, 75, 70, 94,  3],
       [66,  0, 53, 25, 54],
       [89, 19, 54, 98, 92],
       [83, 16, 28, 88, 65],
       [28, 49, 64, 26, 44]])

Create a DataFrame from the nums array, called df.
Label the columns: A,B,C,D,E
Label the index: V,W,X,Y,Z
Display the DataFrame.

In [37]:
list_column = ["A", "B", "C", "D", "E"]
list_index = ["V", "W", "X", "Y", "Z"]
df = pd.DataFrame(nums, index=list_index, columns=list_column)
df

    A   B   C   D   E
V  41  75  70  94   3
W  66   0  53  25  54
X  89  19  54  98  92
Y  83  16  28  88  65
Z  28  49  64  26  44

Display columns B and D.

In [38]:
df[["B","D"]]

    B   D
V  75  94
W   0  25
X  19  98
Y  16  88
Z  49  26

Display rows X and Y.

In [39]:
df.loc[["X","Y"]]

    A   B   C   D   E
X  89  19  54  98  92
Y  83  16  28  88  65

Display element YC.

In [40]:
df.loc["Y","C"]

28

Display rows X and Y, and columns B and D.

In [41]:
df.loc[["X","Y"], ["B","D"]]

    B   D
X  19  98
Y  16  88

Add a new column F, which is column A x column B.
Display the resulting DataFrame.

In [42]:
df["F"] = df["A"] * df["B"]
df

    A   B   C   D   E     F
V  41  75  70  94   3  3075
W  66   0  53  25  54     0
X  89  19  54  98  92  1691
Y  83  16  28  88  65  1328
Z  28  49  64  26  44  1372

Permanently drop row V and column F.
Display the resulting DataFrame.

In [43]:
df.drop(index="V", columns="F", inplace=True)
df

    A   B   C   D   E
W  66   0  53  25  54
X  89  19  54  98  92
Y  83  16  28  88  65
Z  28  49  64  26  44